# GetSortGroupFieldCount Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetSortGroupFieldCount Method
ScheduleDefinition Class See Also
---
Gets the number of sorting/grouping fields in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetSortGroupFieldCount()
```

Visual Basic
---
```text
Public Function GetSortGroupFieldCount As Integer
```

Visual C++
---
```text
public:
int GetSortGroupFieldCount()
```

# ### Return Value
The number of sorting/grouping fields.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace